{
    "version": "https://jsonfeed.org/version/1",
    "title": "Rutland TV",
    "description": "",
    "home_page_url": "https://rutland.tv",
    "feed_url": "https://rutland.tv/feed.json",
    "user_comment": "",
    "author": {
        "name": "Joseph Rutland"
    },
    "items": [
        {
            "id": "https://rutland.tv/charity/",
            "url": "https://rutland.tv/charity/",
            "title": "Charity",
            "summary": "For his new release 'Charity' Joseph wanted to capture the eerie feeling of his living quaters in Vietnam. Many of the shots involving shadows were based on his own experiences in his dark windowless room. The script was translated into Vietnamese by the talented Phan&hellip;",
            "content_html": "<p>For his new release 'Charity' Joseph wanted to capture the eerie feeling of his living quaters in Vietnam. Many of the shots involving shadows were based on his own experiences in his dark windowless room. The script was translated into Vietnamese by the talented Phan Quoc Anh. </p>\n<p><br>Whilst preparing for the shoot, there were a couple of oversights. Joseph left the props to the last minute so he ended up paying through the nose for the mask. </p>\n<p><br>Joseph also had trouble in his search for string. He traveled to every corner of Ho Chi Minh city in search for string, stopping in and chatting to the proprietors of many craft shops around the city, but was unable to find any string.</p>\n<p>Joseph, however, had a stoke of luck! He asked his ever-faithful friend Callum Caddell to hold the mask onto the actor and pretend to be an extra set of arms. </p>",
            "image": "https://rutland.tv/media/posts/32/charity.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2025-05-31T16:09:00+03:00",
            "date_modified": "2025-07-07T16:20:31+03:00"
        },
        {
            "id": "https://rutland.tv/one-more-for-the-road/",
            "url": "https://rutland.tv/one-more-for-the-road/",
            "title": "One More For The Road",
            "summary": "Joseph has recently starred in the final film (During Uni) of fellow director 'Alex Fletcher'. This film was quite wild, he was brought in last second with many mishaps occuring. A group of freinds is summoned by a magical wizard who wishes to make the&hellip;",
            "content_html": "<p>Joseph has recently starred in the final film (During Uni) of fellow director 'Alex Fletcher'. This film was quite wild, he was brought in last second with many mishaps occuring. A group of freinds is summoned by a magical wizard who wishes to make the boys drink his 'wizard seed', this was very very strange indeed.</p>\n<p>The scene where the second wizard arrives was origionally supposed to have a hostage trapped in the boot of the wizard's car. Also, there were little elf hats we were initially supposed to wear but it was unfortunately decided against to the sadness of many people.</p>",
            "image": "https://rutland.tv/media/posts/38/One-More2_1.1.1.png",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2025-05-03T22:47:00+03:00",
            "date_modified": "2025-07-13T22:50:16+03:00"
        },
        {
            "id": "https://rutland.tv/joseph-in-istanbul/",
            "url": "https://rutland.tv/joseph-in-istanbul/",
            "title": "Joseph in Istanbul",
            "summary": "Joseph is a prolific lover of all things Turkish, so it utterly delighted him to finally visit the place. He got by with the small ammount of Turkish he knew. However, the most exciting thing for him was the pre-arranged meeting with artist 'C.M.Kosemen' author&hellip;",
            "content_html": "<p>Joseph is a prolific lover of all things Turkish, so it utterly delighted him to finally visit the place. He got by with the small ammount of Turkish he knew. </p>\n<p>However, the most exciting thing for him was the pre-arranged meeting with artist 'C.M.Kosemen' author of 'All Tommorows' which Joseph had arranged. They talked for hours whilst Kosemen created art for Joseph's family and freinds. </p>\n<p>This was such an amazing city, Joseph wishes he could've stayed there forever.</p>",
            "image": "https://rutland.tv/media/posts/40/20250125_131711.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Right Now"
            ],
            "date_published": "2025-01-28T23:04:00+02:00",
            "date_modified": "2025-07-13T23:05:53+03:00"
        },
        {
            "id": "https://rutland.tv/bye-bye-vietnam/",
            "url": "https://rutland.tv/bye-bye-vietnam/",
            "title": "Bye Bye Vietnam!",
            "summary": "Finally, after months of misery, Joseph has left Vietnam for good. However he knows that there are many things he'll miss. Grab racing, cheap and cool transport, temples everywhere, koi fish cafe's, Iguanas everywhere and the feeling of independance that living in another country gave&hellip;",
            "content_html": "<p>Finally, after months of misery, Joseph has left Vietnam for good. However he knows that there are many things he'll miss. Grab racing, cheap and cool transport, temples everywhere, koi fish cafe's, Iguanas everywhere and the feeling of independance that living in another country gave him.</p>\n<p>On his last night, he sat outside by the temple and sampled 10 mins of audio recording from by the road for future projects. He also got a sneaky tattoo before he left. </p>\n<p>It was time for Joseph to return home (via Turkey) to all the things he missed: freinds, family, Iceland 3 for £3 deal, Wetherspoons 3 small plates for £13 deal, his pets and of course his camera equipment.</p>",
            "image": "https://rutland.tv/media/posts/41/20250122_211131.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Right Now"
            ],
            "date_published": "2025-01-22T23:11:00+02:00",
            "date_modified": "2025-07-13T23:11:37+03:00"
        },
        {
            "id": "https://rutland.tv/joseph-in-indonesia/",
            "url": "https://rutland.tv/joseph-in-indonesia/",
            "title": "Joseph in Jakarta",
            "summary": "In the last leg of my trip, Joseph went to Indonesia. Possibly the best accomodation in Asia he's ever experienced. On the second day, Joseph and Christian went to the beach where a bunch of Indonesian kids kept asking questions such as 'Do you like&hellip;",
            "content_html": "<p>In the last leg of my trip, Joseph went to Indonesia. Possibly the best accomodation in Asia he's ever experienced. On the second day, Joseph and Christian went to the beach where a bunch of Indonesian kids kept asking questions such as 'Do you like Apples?' 'Do you like Cats?' and various other flavours of that question. Joseph also had the worst fish and chips of his life on that beach. </p>\n<p>He and Christian then ventured (On a guided tour) to a tea plantation and an active volacano. Volcanoes stink, they are absolutely aweful on the nose. Joseph nearly bought a blow-dart from a volcano woman and he's glad he didn't because they're illegal in the UK (Who knew). Afterwards, he and Christian retired to a Volcanic spar where they got their feet nice and massaged.</p>\n<p>Unfortunately, this was to be the last night before Christian headed back to Finland, so they grabbed a random Indonesian man called Ricky and went to a swinging 20's themed jazz/pizza bar and the three of them had a wonderful candlelit dinner.</p>",
            "image": "https://rutland.tv/media/posts/37/IMG-20250117-WA0008.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Right Now"
            ],
            "date_published": "2025-01-18T22:29:00+02:00",
            "date_modified": "2025-07-13T22:52:30+03:00"
        },
        {
            "id": "https://rutland.tv/janus/",
            "url": "https://rutland.tv/janus/",
            "title": "Janus",
            "summary": "Joseph has created a film challange using four directors who all work different parts on 4 different films. A bit confusing but fun. Joseph's mind was swimming when he got this script, his first decision was to cast Ben Hillyer as Lane, unfortunatley Ben wasn't&hellip;",
            "content_html": "<p>Joseph has created a film challange using four directors who all work different parts on 4 different films. A bit confusing but fun.</p>\n<p>Joseph's mind was swimming when he got this script, his first decision was to cast Ben Hillyer as Lane, unfortunatley Ben wasn't avaliable but that didn't stop him. This was also the first(ish, if you don't count Fictus Medicus) film where Joseph used body doubles. Unfortunately for Lane's apartment which was supposed to be covered in empty alcohol bottles, Joseph couldn't find any.  However, he made the quick decision that the character had auto-brewery syndrome, causing the bread that Joseph strew about to turn into alcohol in the character's stomach.</p>",
            "image": "https://rutland.tv/media/posts/39/b830b1a8-b331-46f0-a293-186284339f71-1.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2024-08-11T23:00:00+03:00",
            "date_modified": "2025-07-13T23:00:27+03:00"
        },
        {
            "id": "https://rutland.tv/the-eighth-boatman/",
            "url": "https://rutland.tv/the-eighth-boatman/",
            "title": "The Eighth Boatman",
            "summary": "Joseph first came up with the idea for this script during a writing exercise. He wanted to make a film that would make people come up with their own interpretations on the ending, the. It also bothered Joseph, the amount of sappy short films where&hellip;",
            "content_html": "<p>Joseph first came up with the idea for this script during a writing exercise. He wanted to make a film that would make people come up with their own interpretations on the ending, the. It also bothered Joseph, the amount of sappy short films where two strangers bond over shared loss or trauma, which felt very cookie-cutter. This film was meant as the inverse of this trope; yes, they are both experiencing loss, however the characters strongly dislike one-another and the Boatman desperately wants this disrespectful stranger to just bugger off.</p>",
            "image": "https://rutland.tv/media/posts/30/eighth_boatman.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2024-06-20T15:49:00+03:00",
            "date_modified": "2025-07-07T15:51:47+03:00"
        },
        {
            "id": "https://rutland.tv/grit/",
            "url": "https://rutland.tv/grit/",
            "title": "Grit",
            "summary": "For this one, Joseph was inspired by various analogue horror series such as 'Gemini Home Entertainment' and 'Mystery Flesh Pit National Park'. The idea writing a horror anthology which fleshes out a world in around five minuets was an interesting challange that he through himself&hellip;",
            "content_html": "<p>For this one, Joseph was inspired by various analogue horror series such as 'Gemini Home Entertainment' and 'Mystery Flesh Pit National Park'. The idea writing a horror anthology which fleshes out a world in around five minuets was an interesting challange that he through himself into with abandon. It gave him the oppertunity to work with alot of actors who he had enjoyed working with in the past. <br>This project was also a collaboration with Alex and Peter, who were amazing help throughout.</p>",
            "image": "https://rutland.tv/media/posts/31/grit.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2024-04-19T16:01:00+03:00",
            "date_modified": "2025-07-07T16:01:41+03:00"
        },
        {
            "id": "https://rutland.tv/head-splitting/",
            "url": "https://rutland.tv/head-splitting/",
            "title": "Head Splitting",
            "summary": "Head splitting was Joseph's first real attempt at creating effects with a mixture of editing and practical instead of wholesale practical. The David Bowie motif throughout the film was inspired a household he once visited which was covered wall-to-wall in Bowie memorabilia. The opening shot&hellip;",
            "content_html": "<p>Head splitting was Joseph's first real attempt at creating effects with a mixture of editing and practical instead of wholesale practical. The David Bowie motif throughout the film was inspired a household he once visited which was covered wall-to-wall in Bowie memorabilia.<br>The opening shot was one he had wanted to do for a while, originally envisioned for Juicy - in fact, the filming location was where Juicy was supposed to be shot before problems arose. <br>One amazing thing about this shoot was Jitindra, the actor who's apartment we were using. Not only can the man act, but he can cook too. </p>",
            "image": "https://rutland.tv/media/posts/34/head_splitting.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2024-04-02T16:38:00+03:00",
            "date_modified": "2025-07-13T15:30:34+03:00"
        },
        {
            "id": "https://rutland.tv/joseph-in-gdansk/",
            "url": "https://rutland.tv/joseph-in-gdansk/",
            "title": "Joseph In Gdansk",
            "summary": "Joseph has recently been trecking around Western Poland with his Girlfrend. Stranded outside on the first night, they had to seek refuge in a Blues Brothers themed bar. He ventured from Gdansk to Sopot (Polish Southport, complete with a nice curry) and the cold fishing&hellip;",
            "content_html": "<p>Joseph has recently been trecking around Western Poland with his Girlfrend. Stranded outside on the first night, they had to seek refuge in a Blues Brothers themed bar.</p>\n<p>He ventured from Gdansk to Sopot (Polish Southport, complete with a nice curry) and the cold fishing village of Hel where he trecked through old German forts and trenches.</p>",
            "image": "https://rutland.tv/media/posts/36/IMG-20240414-WA0034.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Right Now"
            ],
            "date_published": "2024-02-28T15:56:00+02:00",
            "date_modified": "2025-07-13T22:52:39+03:00"
        }
    ]
}
