{
    "version": "https://jsonfeed.org/version/1",
    "title": "Rutland TV",
    "description": "",
    "home_page_url": "https://rutland.tv",
    "feed_url": "https://rutland.tv/feed.json",
    "user_comment": "",
    "author": {
        "name": "Joseph Rutland"
    },
    "items": [
        {
            "id": "https://rutland.tv/charity/",
            "url": "https://rutland.tv/charity/",
            "title": "Charity",
            "summary": "For his new release 'Charity' Joseph wanted to capture the eerie feeling of his living quaters in Vietnam. Many of the shots involving shadows were based on his own experiences in his dark windowless room. The script was translated into Vietnamese by the talented Phan&hellip;",
            "content_html": "<p>For his new release 'Charity' Joseph wanted to capture the eerie feeling of his living quaters in Vietnam. Many of the shots involving shadows were based on his own experiences in his dark windowless room. The script was translated into Vietnamese by the talented Phan Quoc Anh. </p>\n<p><br>Whilst preparing for the shoot, there were a couple of oversights. Joseph left the props to the last minute so he ended up paying through the nose for the mask. </p>\n<p><br>Joseph also had trouble in his search for string. He traveled to every corner of Ho Chi Minh city in search for string, stopping in and chatting to the proprietors of many craft shops around the city, but was unable to find any string.</p>\n<p>Joseph, however, had a stoke of luck! He asked his ever-faithful friend Callum Caddell to hold the mask onto the actor and pretend to be an extra set of arms. </p>",
            "image": "https://rutland.tv/media/posts/32/charity.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2025-05-31T14:09:00+01:00",
            "date_modified": "2025-07-07T14:20:31+01:00"
        },
        {
            "id": "https://rutland.tv/the-eighth-boatman/",
            "url": "https://rutland.tv/the-eighth-boatman/",
            "title": "The Eighth Boatman",
            "summary": "Joseph first came up with the idea for this script during a writing exercise. He wanted to make a film that would make people come up with their own interpretations on the ending, the. It also bothered Joseph, the amount of sappy short films where&hellip;",
            "content_html": "<p>Joseph first came up with the idea for this script during a writing exercise. He wanted to make a film that would make people come up with their own interpretations on the ending, the. It also bothered Joseph, the amount of sappy short films where two strangers bond over shared loss or trauma, which felt very cookie-cutter. This film was meant as the inverse of this trope; yes, they are both experiencing loss, however the characters strongly dislike one-another and the Boatman desperately wants this disrespectful stranger to just bugger off.</p>",
            "image": "https://rutland.tv/media/posts/30/eighth_boatman.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2024-06-20T13:49:00+01:00",
            "date_modified": "2025-07-07T13:51:47+01:00"
        },
        {
            "id": "https://rutland.tv/grit/",
            "url": "https://rutland.tv/grit/",
            "title": "Grit",
            "summary": "For this one, Joseph was inspired by various analogue horror series such as 'Gemini Home Entertainment' and 'Mystery Flesh Pit National Park'. The idea writing a horror anthology which fleshes out a world in around five minuets was an interesting challange that he through himself&hellip;",
            "content_html": "<p>For this one, Joseph was inspired by various analogue horror series such as 'Gemini Home Entertainment' and 'Mystery Flesh Pit National Park'. The idea writing a horror anthology which fleshes out a world in around five minuets was an interesting challange that he through himself into with abandon. It gave him the oppertunity to work with alot of actors who he had enjoyed working with in the past. <br>This project was also a collaboration with Alex and Peter, who were amazing help throughout.</p>",
            "image": "https://rutland.tv/media/posts/31/grit.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2024-04-19T14:01:00+01:00",
            "date_modified": "2025-07-07T14:01:41+01:00"
        },
        {
            "id": "https://rutland.tv/head-splitting/",
            "url": "https://rutland.tv/head-splitting/",
            "title": "Head Splitting",
            "summary": "Head splitting was Joseph's first real attempt at creating effects with a mixture of editing and practical instead of wholesale practical. The David Bowie motif throughout the film was inspired a household he once visited which was covered wall-to-wall in Bowie memorabilia. The opening shot&hellip;",
            "content_html": "<p>Head splitting was Joseph's first real attempt at creating effects with a mixture of editing and practical instead of wholesale practical. The David Bowie motif throughout the film was inspired a household he once visited which was covered wall-to-wall in Bowie memorabilia.<br>The opening shot was one he had wanted to do for a while, originally envisioned for Juicy - in fact, the filming location was where Juicy was supposed to be shot before problems arose. <br>One amazing thing about this shoot was Jitindra, the actor who's apartment we were using. Not only can the man act, but he can cook too. </p>",
            "image": "https://rutland.tv/media/posts/34/head_splitting.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
            ],
            "date_published": "2024-04-02T14:38:00+01:00",
            "date_modified": "2025-07-07T14:39:52+01:00"
        },
        {
            "id": "https://rutland.tv/autonomy-by-owen-saddington/",
            "url": "https://rutland.tv/autonomy-by-owen-saddington/",
            "title": "Autonomy By Owen Saddington",
            "summary": "For this film, Joseph played the part of somebody trapped in his film for a director down in Stoke on Trent. The film was supposed to be experimental by nature. Joseph really didn't like Stoke on Trent as it was incredibly foggy and cold and&hellip;",
            "content_html": "<div>For this film, Joseph played the part of somebody trapped in his film for a director down in Stoke on Trent. The film was supposed to be experimental by nature.</div>\n<div> </div>\n<div>Joseph really didn't like Stoke on Trent as it was incredibly foggy and cold and he was really hungry the whole time.</div>\n<div> </div>\n<div><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/qLzL5QMkSvY?si=M2tIeVuVdrMBr-K2\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"allowfullscreen\"></iframe></div></div>",
            "image": "https://rutland.tv/media/posts/4/joseph_rutland_in_stoke.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2023-10-09T12:10:00+01:00",
            "date_modified": "2025-07-07T12:14:12+01:00"
        },
        {
            "id": "https://rutland.tv/a-lovely-bbq/",
            "url": "https://rutland.tv/a-lovely-bbq/",
            "title": "A Lovely BBQ",
            "summary": "Wanting to make use of leftover by-products from casting faces in resin, Joseph came up with the idea of his film 'A Lovely BBQ'. The film was shot entirely on a DJI Mini camera, giving it a somewhat surreal feeling due to the wide angle&hellip;",
            "content_html": "<div class=\"wrapper post__entry\">\n<div>Wanting to make use of leftover by-products from casting faces in resin, Joseph came up with the idea of his film 'A Lovely BBQ'. The film was shot entirely on a DJI Mini camera, giving it a somewhat surreal feeling due to the wide angle lens of the camera.</div>\n<div> </div>\n<div>Joseph directed this piece with a great set of four actors and no additional crew which led to an incredibly efficient filming time.</div>\n</div>",
            "image": "https://rutland.tv/media/posts/5/bbq.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2023-06-08T12:14:00+01:00",
            "date_modified": "2025-07-07T12:15:57+01:00"
        },
        {
            "id": "https://rutland.tv/fictus-medicus/",
            "url": "https://rutland.tv/fictus-medicus/",
            "title": "Fictus Medicus",
            "summary": "The idea of doing a historical piece had been on Joseph's mind for a while. This script had quite a few superficial changes throughout. It had been envisioned that the plague victims were initially knights instead of peasants and the whole piece was supposed to&hellip;",
            "content_html": "<p>The idea of doing a historical piece had been on Joseph's mind for a while. This script had quite a few superficial changes throughout. It had been envisioned that the plague victims were initially knights instead of peasants and the whole piece was supposed to take place outdoors. <br>A tutor suggested that the period setting may be too difficult to pull off and setting it in the modern day may be easier but Joseph was resolute in his motivation. His favourite part of the film is the chicken gag, which caused a lot of trouble on set due to local dogs trying their hardest to get at it.</p>",
            "image": "https://rutland.tv/media/posts/33/fictus_medicus.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2023-04-23T14:19:00+01:00",
            "date_modified": "2025-07-07T14:19:22+01:00"
        },
        {
            "id": "https://rutland.tv/juicy/",
            "url": "https://rutland.tv/juicy/",
            "title": "Juicy!",
            "summary": "Recently Joseph has collaborated with his writer accomplice 'Cat Wray' to write a few short films, beginning with Juicy. Juicy was a labour of love whilst also being really really annoying to film, with locations cancelling and trains not working. But through all of this,&hellip;",
            "content_html": "<p>Recently Joseph has collaborated with his writer accomplice 'Cat Wray' to write a few short films, beginning with Juicy. Juicy was a labour of love whilst also being really really annoying to film, with locations cancelling and trains not working. But through all of this, we got thejob done, and It looks damn good, if a little sticky.</p>",
            "image": "https://rutland.tv/media/posts/6/cast_members_of_juicy.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2023-02-06T12:16:00+00:00",
            "date_modified": "2025-07-07T12:17:36+01:00"
        },
        {
            "id": "https://rutland.tv/wee-willie-winkie-www/",
            "url": "https://rutland.tv/wee-willie-winkie-www/",
            "title": "Wee Willie Winkie (WWW) ",
            "summary": "Recently Joseph has written, directed and starred in a short film called WWW (Short for Wee Willie Winkie). It was filmed in an absolutely boiling hot room with a very small window but the cast and crew knuckled down and produced something everybody could be&hellip;",
            "content_html": "<p>Recently Joseph has written, directed and starred in a short film called WWW (Short for Wee Willie Winkie). It was filmed in an absolutely boiling hot room with a very small window but the cast and crew knuckled down and produced something everybody could be proud of.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://rutland.tv/media/posts/7/cast_of_wee_willie_winkie_WWW.jpg\" alt=\"Three men in a dark room. One is in nightwear with a sleeping cap.\" width=\"1680\" height=\"904\" sizes=\"100vw\" srcset=\"https://rutland.tv/media/posts/7/responsive/cast_of_wee_willie_winkie_WWW-xs.jpg 300w ,https://rutland.tv/media/posts/7/responsive/cast_of_wee_willie_winkie_WWW-sm.jpg 480w ,https://rutland.tv/media/posts/7/responsive/cast_of_wee_willie_winkie_WWW-md.jpg 768w ,https://rutland.tv/media/posts/7/responsive/cast_of_wee_willie_winkie_WWW-lg.jpg 1024w ,https://rutland.tv/media/posts/7/responsive/cast_of_wee_willie_winkie_WWW-xl.jpg 1360w ,https://rutland.tv/media/posts/7/responsive/cast_of_wee_willie_winkie_WWW-2xl.jpg 1600w\"></figure>",
            "image": "https://rutland.tv/media/posts/7/joseph_rutland_in_wee_willie_winkie_WWW.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2023-01-29T12:18:00+00:00",
            "date_modified": "2025-07-07T12:20:07+01:00"
        },
        {
            "id": "https://rutland.tv/the-dog-expert-a-48-hour-film-challenge/",
            "url": "https://rutland.tv/the-dog-expert-a-48-hour-film-challenge/",
            "title": "The Dog Expert - A 48 hour film challenge",
            "summary": "Recently, I worked alongside fellow creatives, Keiran Riley, Will Knowles, and Cat Wray for a 48 hour film challenge using my own equipment. It wasn't a complete failure, as we only came last in one of the two categories. We also managed to obtain the&hellip;",
            "content_html": "<div class=\"wrapper post__entry\">\n<div>\n<div>Recently, I worked alongside fellow creatives, Keiran Riley, Will Knowles, and Cat Wray for a 48 hour film challenge using my own equipment. It wasn't a complete failure, as we only came last in one of the two categories. We also managed to obtain the high honour of second-to-last in the other category.</div>\n<br>\n<div>My dog urinated on my arm during production - thrilling!</div>\n</div>\n</div>",
            "image": "https://rutland.tv/media/posts/8/joseph-rutland-the-dog-expert.jpg",
            "author": {
                "name": "Joseph Rutland"
            },
            "tags": [
                   "Film and acting"
            ],
            "date_published": "2022-11-19T12:36:00+00:00",
            "date_modified": "2025-07-07T12:37:34+01:00"
        }
    ]
}
